In [16]:
import pandas as pd

In [17]:
base = pd.read_csv('credit_data.csv')

In [18]:
base

      i#clientid        income        age         loan  c#default
0              1  66155.925095  59.017015  8106.532131          0
1              2  34415.153966  48.117153  6564.745018          0
2              3  57317.170063  63.108049  8020.953296          0
3              4  42709.534201  45.751972  6103.642260          0
4              5  66952.688845  18.584336  8770.099235          1
...          ...           ...        ...          ...        ...
1995        1996  59221.044874  48.518179  1926.729397          0
1996        1997  69516.127573  23.162104  3503.176156          0
1997        1998  44311.449262  28.017167  5522.786693          1
1998        1999  43756.056605  63.971796  1622.722598          0
1999        2000  69436.579552  56.152617  7378.833599          0

[2000 rows x 5 columns]

In [19]:
base.head()

   i#clientid        income        age         loan  c#default
0           1  66155.925095  59.017015  8106.532131          0
1           2  34415.153966  48.117153  6564.745018          0
2           3  57317.170063  63.108049  8020.953296          0
3           4  42709.534201  45.751972  6103.642260          0
4           5  66952.688845  18.584336  8770.099235          1

In [20]:
base.rename(columns={'age':'idade', 'i#clientid':'id'}, inplace=True)

In [21]:
base.head()

   id        income      idade         loan  c#default
0   1  66155.925095  59.017015  8106.532131          0
1   2  34415.153966  48.117153  6564.745018          0
2   3  57317.170063  63.108049  8020.953296          0
3   4  42709.534201  45.751972  6103.642260          0
4   5  66952.688845  18.584336  8770.099235          1

In [22]:
base.describe()

                id        income        idade          loan    c#default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [26]:
"Há valores negativos no atributo 'idade', por isso, é necessário fazer um tratamento para apagar esses dados. Afinal, leva-se em consideração que idade negativa não existe."

"Há valores negativos no atributo 'idade', por isso, é necessário fazer um tratamento para apagar esses dados. Afinal, leva-se em consideração que idade negativa não existe."

In [24]:
base.loc[base['idade'] < 0]

    id        income      idade         loan  c#default
15  16  50501.726689 -28.218361  3977.287432          0
21  22  32197.620701 -52.423280  4244.057136          0
26  27  63287.038908 -36.496976  9595.286289          0

In [28]:
base.drop(base[base.idade < 0].index, inplace=True)

In [30]:
base.describe()

                id        income        idade          loan    c#default
count  1997.000000   1997.000000  1994.000000   1997.000000  1997.000000
mean   1001.970456  45326.596720    40.927700   4442.124566     0.141713
std     576.679293  14327.971550    13.271802   3045.494192     0.348842
min       1.000000  20014.489470    18.055189      1.377630     0.000000
25%     503.000000  32804.904487    29.043284   1936.813257     0.000000
50%    1002.000000  45788.747100    41.382673   3971.155479     0.000000
75%    1501.000000  57787.565659    52.616900   6429.593688     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [31]:
base.loc[base['idade'] < 0]

Empty DataFrame
Columns: [id, income, idade, loan, c#default]
Index: []

In [32]:
base['idade'].mean()

40.92770044906149

In [34]:
"======================================================================================================"

'======================================================================================================'

In [33]:
"Os valores negativos atribuidos às idades foram removidos, isso é uma forma de tratar dados inconsistentes. Porém, isso TAMBÉM podemia ter sido feito de uma outra maneira: atribuindo a média dos valores POSITIVOS aos valores INCONSISTENTES."

'Os valores negativos atribuidos às idades foram removidos, isso é uma forma de tratar dados inconsistentes. Porém, isso TAMBÉM podemia ter sido feito de uma outra maneira: atribuindo a média dos valores POSITIVOS aos valores INCONSISTENTES.'

In [35]:
"Chamando novamente a base de dados sem o tratamento feito:"

'Chamando novamente a base de dados sem o tratamento feito:'

In [36]:
base = pd.read_csv('credit_data.csv')

In [39]:
base.describe() # Perceba que os valores negativos estão de volta, pois foi solicitada novamente a leitura do arquivo com os dados originais

        i#clientid        income          age          loan    c#default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [41]:
base.rename(columns={'i#clientid':'id', 'age':'idade'}, inplace=True)

In [42]:
base.describe()

                id        income        idade          loan    c#default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [47]:
base['idade'][base.idade > 0].mean() # calculando a média dos valores maiores que zero no atributo 'idade'

40.92770044906149

In [50]:
base.loc[base.idade < 0] = 40.92770044906149 # atribuindo o valor da média dos valores maiores que zero do atributo 'idade' aos campos em que estão com valores menores que zero

In [51]:
base.describe()

                id        income        idade          loan    c#default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.528892  45258.668216    40.927700   4435.522771     0.202892
std     577.446047  14424.139092    13.261825   3047.973441     1.616866
min       1.000000     40.927700    18.055189      1.377630     0.000000
25%     500.750000  32751.700392    29.072097   1932.453823     0.000000
50%    1000.500000  45776.207139    41.317159   3964.990626     0.000000
75%    1500.250000  57771.032285    52.587040   6428.192991     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239    40.927700

In [52]:
base.loc[base.idade < 0]

Empty DataFrame
Columns: [id, income, idade, loan, c#default]
Index: []

In [53]:
"======================================================================================================"

'======================================================================================================'

In [54]:
"Tratamento de dados FALTANTES:"

'Tratamento de dados FALTANTES:'

In [55]:
pd.isnull(base['idade'])

0       False
1       False
2       False
3       False
4       False
        ...
1995    False
1996    False
1997    False
1998    False
1999    False
Name: idade, Length: 2000, dtype: bool

In [57]:
base.loc[pd.isnull(base['idade'])] # Encontrados os valores faltantes (NaN == Not a Number)

      id        income  idade         loan  c#default
28  29.0  59417.805406    NaN  2082.625938        0.0
30  31.0  48528.852796    NaN  6155.784670        0.0
31  32.0  23526.302555    NaN  2862.010139        0.0

In [73]:
previsores = base.iloc[:, 1:4].values # [todas as linhas, colunas de 1 a 3]
classe = base.iloc[:, 4].values # [todas as linhas, apenas coluna 4]

In [74]:
previsores

array([[6.61559251e+04, 5.90170151e+01, 8.10653213e+03],
       [3.44151540e+04, 4.81171531e+01, 6.56474502e+03],
       [5.73171701e+04, 6.31080495e+01, 8.02095330e+03],
       ...,
       [4.43114493e+04, 2.80171669e+01, 5.52278669e+03],
       [4.37560566e+04, 6.39717958e+01, 1.62272260e+03],
       [6.94365796e+04, 5.61526170e+01, 7.37883360e+03]])

In [75]:
classe

array([0., 0., 0., ..., 1., 0., 0.])

In [76]:
from sklearn.impute import SimpleImputer

In [85]:
import numpy as np
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')

# np.nan é um método do Numpy para identificar dados faltantes (tipo 'NaN')

In [86]:
imputer = imputer.fit(previsores[:, 0:3])

In [89]:
previsores[:, 0:3] = imputer.transform(previsores[:, 0:3])

In [91]:
previsores

array([[6.61559251e+04, 5.90170151e+01, 8.10653213e+03],
       [3.44151540e+04, 4.81171531e+01, 6.56474502e+03],
       [5.73171701e+04, 6.31080495e+01, 8.02095330e+03],
       ...,
       [4.43114493e+04, 2.80171669e+01, 5.52278669e+03],
       [4.37560566e+04, 6.39717958e+01, 1.62272260e+03],
       [6.94365796e+04, 5.61526170e+01, 7.37883360e+03]])

In [96]:
base.loc[pd.isnull(base['idade'])]

Empty DataFrame
Columns: [id, income, idade, loan, c#default]
Index: []

In [97]:
"Valores faltantes foram removidos ^_^"

'Valores faltantes foram removidos ^_^'

In [98]:
"======================================================================================================"

'======================================================================================================'

In [99]:
"Fazendo o escalonamento dos valores ===> deixando os valores na mesma escala"

'Fazendo o escalonamento dos valores ===> deixando os valores na mesma escala'

In [100]:
from sklearn.preprocessing import StandardScaler

In [101]:
scaler = StandardScaler() # Padronização (Standartisation)

In [106]:
previsores = scaler.fit_transform(previsores)

In [107]:
previsores

array([[ 1.44913211,  1.36538005,  1.20471111],
       [-0.75194964,  0.54265932,  0.69874452],
       [ 0.83620364,  1.67417101,  1.17662679],
       ...,
       [-0.06568543, -0.97448606,  0.35680621],
       [-0.10419945,  1.73936652, -0.92307354],
       [ 1.67663095,  1.14917551,  0.96590308]])

In [108]:
"Percebe-se que agora os valores estão com escalas bem mais próximas"

'Percebe-se que agora os valores estão com escalas bem mais próximas'